In [3]:
import sqlite3

In [4]:
con=sqlite3.connect("Employeedatabse.db")

In [5]:
cur=con.cursor()

In [6]:
cur.execute("create table employee(id int primary key, name free, age int)")

In [7]:
cur.execute("insert into employee values(101,'john',23),(102,'ajeet',25),(103,'punnet',26)")

In [8]:
print(cur.rowcount,'Rows Inbound')

3 Rows Inbound

In [12]:
cur.execute("insert into employee values(106,'jeet',28),(107,'pink',29)")

print(cur.rowcount,'Rows Inbound')

2 Rows Inbound

In [16]:
r=cur.execute("select * from employee")

for i in r:
    print(i)

(101, 'john', 23)
(102, 'ajeet', 25)
(103, 'punnet', 26)
(104, 'jeet', 28)
(105, 'pink', 29)
(106, 'jeet', 28)
(107, 'pink', 29)

In [17]:
r=cur.execute("select age,name from employee")

for i in r:
    print(i)

(23, 'john')
(25, 'ajeet')
(26, 'punnet')
(28, 'jeet')
(29, 'pink')
(28, 'jeet')
(29, 'pink')

In [18]:
r=cur.execute("select age,id from employee")

for i in r:
    print(i)

(23, 101)
(25, 102)
(26, 103)
(28, 104)
(29, 105)
(28, 106)
(29, 107)

In [19]:
r=cur.execute("select age from employee where id in(101,105)")

for i in r:
    print(i)

(23,)
(29,)

In [22]:
r=cur.execute("select name from employee where id=104")
r.fetchone()

('jeet',)

In [23]:
r=cur.execute("select name,age from employee where id=105")

for i in r:
    print(i)

('pink', 29)

In [25]:
r=cur.execute("select name,age from employee where id=105")
r.fetchone()

('pink', 29)

In [27]:
con.commit()

In [29]:
r=cur.execute("Select * from employee")
r.fetchall()

[(101, 'john', 23),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'pink', 29)]

In [31]:
# order by assending

r=cur.execute("Select * from employee order by name asc")
r.fetchall()

[(102, 'ajeet', 25),
 (104, 'jeet', 28),
 (106, 'jeet', 28),
 (101, 'john', 23),
 (105, 'pink', 29),
 (107, 'pink', 29),
 (103, 'punnet', 26)]

In [32]:
# order by descending

r=cur.execute("Select * from employee order by name desc")
r.fetchall()

[(103, 'punnet', 26),
 (105, 'pink', 29),
 (107, 'pink', 29),
 (101, 'john', 23),
 (104, 'jeet', 28),
 (106, 'jeet', 28),
 (102, 'ajeet', 25)]

In [6]:
import sqlite3
con=sqlite3.connect("Employeedatabse.db")

In [7]:
cur=con.cursor()

In [8]:
r=cur.execute("select * from employee")

r.fetchall()

[(101, 'john', 23),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'pink', 29)]

In [23]:
# any one is true or both

r=cur.execute("select * from employee where id>105 or name='pink'")

In [24]:
r.fetchall()

[(105, 'pink', 29), (106, 'jeet', 28), (107, 'pink', 29)]

In [32]:
# both the statement needs to be true

r=cur.execute("select * from employee where id=102 and name='ajeet' ")

In [33]:
r.fetchall()

[(102, 'ajeet', 25)]

# max function

In [34]:
re=cur.execute("select * from employee")

re.fetchall()

[(101, 'john', 23),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'pink', 29)]

In [37]:
cur.execute("update employee set age= 25 where name='john'")

In [38]:
con.commit()

In [40]:
re=cur.execute("select * from employee")

re.fetchall()

[(101, 'john', 25),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'pink', 29)]

In [41]:
cur.execute("update employee set age=27 where id=101")

con.commit()

In [42]:
re=cur.execute("select * from employee")

re.fetchall()

[(101, 'john', 27),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'pink', 29)]

In [43]:
cur.execute("update employee set name='bubhan' where id=107")
con.commit()

In [44]:
re=cur.execute("select * from employee")

re.fetchall()

[(101, 'john', 27),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'bubhan', 29)]

# Like operator

In [46]:
result=cur.execute("select * from employee where name like '%e%'")
result.fetchall()

[(102, 'ajeet', 25), (103, 'punnet', 26), (104, 'jeet', 28), (106, 'jeet', 28)]

In [47]:
result=cur.execute("select * from employee where name like 'p%'")
result.fetchall()

[(103, 'punnet', 26), (105, 'pink', 29)]

In [50]:
result=cur.execute("select * from employee where name like '%t'")
result.fetchall()

[(102, 'ajeet', 25), (103, 'punnet', 26), (104, 'jeet', 28), (106, 'jeet', 28)]

In [60]:
cur.execute("insert into employee values(108,'jack',52),(109,'heena',null)")

print(cur.rowcount,"Rows")

IntegrityError: UNIQUE constraint failed: employee.id

In [61]:
cur.execute("insert into employee values(110,'jack',52),(111,'heena',null)")

print(cur.rowcount,"Rows")

con.commit()

2 Rows

# NULL

In [62]:
# no result as no marks is nill

result=cur.execute("select * from employee where age is null ")

for i in result:
    print(i)

(111, 'heena', None)

# Is and Is not

In [63]:
result=cur.execute("select * from employee where name is 'null'")

result.fetchall()

[]

In [64]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(101, 'john', 27),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (109, 'heena', 0),
 (110, 'jack', 52),
 (111, 'heena', None)]

# Delete any Unwanted records:

In [69]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(101, 'john', 27),
 (102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (109, 'heena', 0),
 (110, 'jack', 52),
 (111, 'heena', None)]

In [77]:
con.execute("delete from employee where age=27")
con.commit()

In [78]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (109, 'heena', 0),
 (110, 'jack', 52),
 (111, 'heena', None)]

In [79]:
con.execute("delete from employee where name='heena'")
con.commit()

In [80]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (106, 'jeet', 28),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (110, 'jack', 52)]

In [81]:
sql="delete from employee where id='106'"

con.execute(sql)
con.commit()

In [82]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (110, 'jack', 52)]

In [83]:
sql="update employee set id=101 where id=110"

cur.execute(sql)
con.commit()

In [84]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

[(102, 'ajeet', 25),
 (103, 'punnet', 26),
 (104, 'jeet', 28),
 (105, 'pink', 29),
 (107, 'bubhan', 29),
 (108, 'jack', 52),
 (101, 'jack', 52)]

# DROP TABLE

In [85]:
# DELETING TABLE

sql="drop table employee"

cur.execute(sql)
con.commit()

In [86]:
result=cur.execute("select * from employee where name is not'null' ")
result.fetchall()

OperationalError: no such table: employee

# closing database

In [87]:
con.close()

# life cycle of data base

"""
CREATE DATABASE : import sqlite3
                  db1=sqlit3.connect("new_studentdatabase.db")
                  
CONNECT TO DATA BASE  : cur=db1.connect()

            CREATE TABLE and INSERTION ON TABLE : 

cur.execute("create table student(name text,id int primarykey, marks notnull)")
cur.execute("insert into student values('chintu',8,70),('chunmun',9,90),('ravi',10,67),('ratul',11,87),('ramesh',12,45)")
db1.commit()

QUARY ON TABLE  :   r=cur.execute("select name,id where marks= 90")

UPDATE OF TABLE : sql="update student set marks=100 where id in(12)"
                  cur.execute(sql)
                  db1.commit()

DELETE A ROW  : sql="delete from student where id=13"

DELETE A TABLE: sql="delete from student where id in(15,14)"
                cur.execute(sql)
                db1.commit()

DROP THE DATABASE= sql='drop table student'
                   results=cur.execute(sql)

CLOSE DATA BASE= connection.CLOSE

# Adding data in table with CSV (coma seperated values) file directly